## Question no.7 & its Answer

In [1]:
import pandas as pd

In [2]:
que7_data = pd.read_csv("Q7.csv")
que7_data.head()

          Unnamed: 0  Points  Score  Weigh
0          Mazda RX4    3.90  2.620  16.46
1      Mazda RX4 Wag    3.90  2.875  17.02
2         Datsun 710    3.85  2.320  18.61
3     Hornet 4 Drive    3.08  3.215  19.44
4  Hornet Sportabout    3.15  3.440  17.02

In [3]:
que7_data.shape

(32, 4)

In [4]:
que7_data.describe(include="all")

       Unnamed: 0     Points      Score      Weigh
count          32  32.000000  32.000000  32.000000
unique         32        NaN        NaN        NaN
top     Mazda RX4        NaN        NaN        NaN
freq            1        NaN        NaN        NaN
mean          NaN   3.596563   3.217250  17.848750
std           NaN   0.534679   0.978457   1.786943
min           NaN   2.760000   1.513000  14.500000
25%           NaN   3.080000   2.581250  16.892500
50%           NaN   3.695000   3.325000  17.710000
75%           NaN   3.920000   3.610000  18.900000
max           NaN   4.930000   5.424000  22.900000

In [16]:
que7_data.rename(columns = {'Unnamed: 0':'Cars_Name'}, inplace = True)
que7_data.head()

           Cars_Name  Points  Score  Weigh
0          Mazda RX4    3.90  2.620  16.46
1      Mazda RX4 Wag    3.90  2.875  17.02
2         Datsun 710    3.85  2.320  18.61
3     Hornet 4 Drive    3.08  3.215  19.44
4  Hornet Sportabout    3.15  3.440  17.02

In [17]:
import warnings
warnings.filterwarnings("ignore")

que7_data.var()

Points    0.285881
Score     0.957379
Weigh     3.193166
dtype: float64

## Question No. 8 & its answer

In [25]:
values = np.array([108, 110, 123, 134, 135, 145, 167, 187, 199])
prob = np.array([1/9, 1/9, 1/9, 1/9,  1/9, 1/9, 1/9, 1/9, 1/9])
    
expected_val = (values*prob).round(4).sum()

print("Expected Value of the Weight of randomly choosen patient is :" ,expected_val)

Expected Value of the Weight of randomly choosen patient is : 145.3334

## Question No. 9 & its answer

In [31]:
que9a_cars_data = pd.read_csv("E:\Data Science\Data Science\Assignments\Basic Stats Level-1\Q9_a.csv")
que9a_cars_data.head()

   Index  speed  dist
0      1      4     2
1      2      4    10
2      3      7     4
3      4      7    22
4      5      8    16

In [32]:
que9a_cars_data.skew()

Index    0.000000
speed   -0.117510
dist     0.806895
dtype: float64

In [33]:
que9a_cars_data.kurt()

Index   -1.200000
speed   -0.508994
dist     0.405053
dtype: float64

In [34]:
que9b_cars_data = pd.read_csv("E:\Data Science\Data Science\Assignments\Basic Stats Level-1\Q9_b.csv")
que9b_cars_data.head()

   Unnamed: 0          SP         WT
0           1  104.185353  28.762059
1           2  105.461264  30.466833
2           3  105.461264  30.193597
3           4  113.461264  30.632114
4           5  104.461264  29.889149

In [38]:
que9b_cars_data.rename(columns = {'Unnamed: 0': 'Cars'}, inplace = True)
que9b_cars_data

    Cars          SP         WT
0      1  104.185353  28.762059
1      2  105.461264  30.466833
2      3  105.461264  30.193597
3      4  113.461264  30.632114
4      5  104.461264  29.889149
..   ...         ...        ...
76    77  169.598513  16.132947
77    78  150.576579  37.923113
78    79  151.598513  15.769625
79    80  167.944460  39.423099
80    81  139.840817  34.948615

[81 rows x 3 columns]

In [39]:
que9b_cars_data.skew()

Cars    0.000000
SP      1.611450
WT     -0.614753
dtype: float64

In [40]:
que9b_cars_data.kurt()

Cars   -1.200000
SP      2.977329
WT      0.950291
dtype: float64

In [1]:
from scipy import stats

In [ ]:
stats.norm.cdf()